TexasInstruments/c2000ware-core-sdk/driverlib/f28003x/examples/dsp/dsp_fpu_rfft_fpu32_f28003x.c
//#############################################################################
//
// FILE:   empty_sysconfig_main.c
//
// TITLE:  Empty Pinmux Example
//
// Empty SysCfg & Driverlib Example
//
// This example is an empty project setup for SysConfig and Driverlib 
// development.
//
//#############################################################################
//
//
// $Copyright:
// Copyright (C) 2026 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//#############################################################################


//
// Included Files
//
#include "driverlib.h"
#include "device.h"
#include "board.h"
#include "c2000ware_libraries.h"

float test_input[256] = {
       0.000000000000F,   28.181947493983F,   38.979458543369F,   28.366989161081F,
       7.326272789999F,   -8.933215669711F,  -13.582694700454F,  -11.190830433269F,
      -9.778131637521F,  -11.220194912225F,  -10.091846750546F,   -1.556763928905F,
      10.877804607379F,   16.890687568601F,    9.470600186751F,   -6.578676281180F,
     -17.191145663469F,  -11.385074517232F,    7.957471898890F,   25.477057400908F,
      26.231864181194F,    8.497010773015F,  -15.114117034451F,  -28.803194057778F,
     -26.330289062628F,  -13.895720526344F,   -1.820659738631F,    5.576678064525F,
      11.696466129355F,   20.231548950995F,   27.674677584129F,   24.848159467490F,
       6.765710093676F,  -19.326270643355F,  -37.061124051535F,  -33.825464341682F,
     -11.912506489176F,   12.729463038734F,   23.526974088120F,   16.454482671904F,
       1.682755942300F,   -7.014881177877F,   -4.541976182728F,    2.901152450406F,
       6.136812160258F,    2.871787971451F,   -1.051128232820F,    0.361570562929F,
       5.234287759679F,    4.978181079424F,   -5.981884268498F,  -22.031160736430F,
     -29.103652152645F,  -17.028591364932F,    9.875806390724F,   34.517775918634F,
      40.323847064870F,   24.411954570794F,   -1.022134150775F,  -19.762475540052F,
     -24.411954570794F,  -19.539237374044F,  -13.733166227808F,   -9.875806390724F,
      -3.756018325894F,    8.319042461819F,   22.031160736430F,   26.766493959325F,
      15.806428611402F,   -5.234287759680F,  -21.146180253756F,  -19.733481458007F,
      -2.871787971450F,   14.647797530568F,   17.883457240420F,    4.541976182727F,
     -13.769728512950F,  -22.467365633126F,  -16.454482671904F,   -2.742364397293F,
       8.055146652093F,   11.912506489177F,   13.040854650856F,   16.276514360708F,
      19.326270643355F,   14.018899597150F,   -4.063549776664F,  -27.674677584130F,
     -41.016158641822F,  -32.481075820181F,   -5.576678064525F,   22.605269429458F,
      34.680330217171F,   26.330289062628F,    8.018584366951F,   -5.670492656376F,
      -8.497010773015F,   -5.447254490368F,   -4.692447710082F,   -7.957471898890F,
      -9.399535173594F,   -3.593464027358F,    6.578676281181F,   11.314009504076F,
       3.893922122225F,  -10.877804607379F,  -19.227845761921F,  -10.692762940280F,
      11.220194912225F,   30.562741328347F,   31.975440124095F,   13.582694700453F,
     -11.851394021116F,  -28.110882480826F,  -28.366989161081F,  -18.194848852542F,
      -7.397337803156F,    0.000000000000F,    7.397337803156F,   18.194848852543F,
      28.366989161081F,   28.110882480826F,   11.851394021114F,  -13.582694700454F,
     -31.975440124096F,  -30.562741328347F,  -11.220194912224F,   10.692762940281F,
      19.227845761921F,   10.877804607379F,   -3.893922122226F,  -11.314009504075F,
      -6.578676281180F,    3.593464027358F,    9.399535173594F,    7.957471898889F,
       4.692447710081F,    5.447254490368F,    8.497010773015F,    5.670492656376F,
      -8.018584366952F,  -26.330289062629F,  -34.680330217170F,  -22.605269429457F,
       5.576678064526F,   32.481075820182F,   41.016158641822F,   27.674677584129F,
       4.063549776663F,  -14.018899597151F,  -19.326270643355F,  -16.276514360708F,
     -13.040854650856F,  -11.912506489177F,   -8.055146652093F,    2.742364397294F,
      16.454482671905F,   22.467365633127F,   13.769728512949F,   -4.541976182728F,
     -17.883457240421F,  -14.647797530568F,    2.871787971451F,   19.733481458007F,
      21.146180253755F,    5.234287759678F,  -15.806428611403F,  -26.766493959325F,
     -22.031160736429F,   -8.319042461818F,    3.756018325895F,    9.875806390724F,
      13.733166227808F,   19.539237374044F,   24.411954570794F,   19.762475540051F,
       1.022134150774F,  -24.411954570795F,  -40.323847064871F,  -34.517775918634F,
      -9.875806390723F,   17.028591364933F,   29.103652152645F,   22.031160736429F,
       5.981884268498F,   -4.978181079424F,   -5.234287759679F,   -0.361570562929F,
       1.051128232819F,   -2.871787971451F,   -6.136812160259F,   -2.901152450406F,
       4.541976182728F,    7.014881177877F,   -1.682755942300F,  -16.454482671905F,
     -23.526974088120F,  -12.729463038733F,   11.912506489178F,   33.825464341683F,
      37.061124051534F,   19.326270643354F,   -6.765710093677F,  -24.848159467491F,
     -27.674677584129F,  -20.231548950995F,  -11.696466129355F,   -5.576678064525F,
       1.820659738631F,   13.895720526345F,   26.330289062629F,   28.803194057778F,
      15.114117034450F,   -8.497010773016F,  -26.231864181195F,  -25.477057400908F,
      -7.957471898889F,   11.385074517233F,   17.191145663468F,    6.578676281180F,
      -9.470600186751F,  -16.890687568600F,  -10.877804607378F,    1.556763928906F,
      10.091846750546F,   11.220194912224F,    9.778131637520F,   11.190830433269F,
      13.582694700454F,    8.933215669711F,   -7.326272790000F,  -28.366989161082F,
     -38.979458543369F,  -28.181947493981F,    0.000000000002F,   28.181947493984F,
      38.979458543369F,   28.366989161080F,    7.326272789998F,   -8.933215669712F,
     -13.582694700454F,  -11.190830433269F,   -9.778131637521F,  -11.220194912226F,
     -10.091846750546F,   -1.556763928904F,   10.877804607380F,   16.890687568602F,
       9.470600186750F,   -6.578676281181F,  -17.191145663469F,  -11.385074517232F,
       7.957471898890F,   25.477057400908F,   26.231864181194F,    8.497010773013F,
};

const float test_golden[514] = {
     106.748590110658F,  106.910178423822F,  107.398698238657F,  108.225667054098F,
     109.411158655199F,  110.985251040248F,  112.990348619429F,  115.484763925068F,
     118.548223333233F,  122.290463916461F,  126.865045465444F,  132.492433382428F,
     139.500575276423F,  148.400922517204F,  160.042876067141F,  175.962498637615F,
     199.291414348249F,  237.676885428253F,  316.516638388944F,  606.732704410254F,
    -938.375039570359F, -103.297896807417F,   22.312901393160F,   87.428329505261F,
     142.149285393466F,  206.262301692562F,  306.062106750733F,  526.797774854296F,
    1702.871991124829F, -1332.157330660842F, -458.259390777422F, -264.499337209123F,
    -176.957118367663F, -125.425237951349F,  -90.029621365984F,  -62.758083506173F,
     -39.462041475429F,  -17.319940255695F,    6.433106675068F,   35.911040331372F,
      80.090158154541F,  168.221497805545F,  503.046847577858F, -1142.927886747019F,
    -314.258973113174F, -193.223180626303F, -143.272848328093F, -115.390527118554F,
     -97.290039626111F,  -84.424489029867F,  -74.713479266842F,  -67.065816104834F,
     -60.851319507124F,  -55.678948412640F,  -51.292137779762F,  -47.514881893513F,
     -44.221961646785F,  -41.321551131515F,  -38.744570325322F,  -36.437905370949F,
     -34.359943499795F,  -32.477545249727F,  -30.763938238871F,  -29.197218660621F,
     -27.759263631143F,  -26.434927518583F,  -25.211438500102F,  -24.077938846578F,
     -23.025130067039F,  -22.044995695043F,  -21.130582345773F,  -20.275825050806F,
     -19.475406623489F,  -18.724643455919F,  -18.019392046257F,  -17.355971932369F,
     -16.731101719287F,  -16.141845638930F,  -15.585568643845F,  -15.059898463375F,
     -14.562693376632F,  -14.092014707916F,  -13.646103245369F,  -13.223358936396F,
     -12.822323333756F,  -12.441664361740F,  -12.080163048147F,  -11.736701928989F,
     -11.410254882399F,  -11.099878188368F,  -10.804702643802F,  -10.523926589279F,
     -10.256809726110F,  -10.002667620669F,   -9.760866808233F,   -9.530820421355F,
      -9.311984278451F,   -9.103853377313F,   -8.905958745817F,   -8.717864608567F,
      -8.539165833669F,   -8.369485628486F,   -8.208473457234F,   -8.055803156690F,
      -7.911171229249F,   -7.774295295071F,   -7.644912687316F,   -7.522779176325F,
      -7.407667810293F,   -7.299367861427F,   -7.197683867851F,   -7.102434762615F,
      -7.013453082179F,   -6.930584247571F,   -6.853685912197F,   -6.782627370966F,
      -6.717289025971F,   -6.657561904544F,   -6.603347225928F,   -6.554556013314F,
      -6.511108748312F,   -6.472935065336F,   -6.439973483674F,   -6.412171175320F,
      -6.389483766939F,   -6.371875174551F,   -6.359317469804F,   -6.351790776899F,
      -6.349283199469F,   -0.112904502147F,   -0.225867254245F,   -0.338946644674F,
      -0.452201339433F,   -0.565690422837F,   -0.679473540515F,   -0.793611045502F,
      -0.908164148253F,   -1.023195071445F,   -1.138767210495F,   -1.254945300761F,
      -1.371795592461F,   -1.489386034458F,   -1.607786468097F,   -1.727068832449F,
      -1.847307382393F,   -1.968578921132F,   -2.090963048920F,   -2.214542429924F,
      -2.339403079399F,   -2.465634673601F,   -2.593330885112F,   -2.722589746639F,
      -2.853514046665F,   -2.986211760820F,   -3.120796523300F,   -3.257388143280F,
      -3.396113171908F,   -3.537105526277F,   -3.680507177659F,   -3.826468912383F,
      -3.975151174929F,   -4.126725004327F,   -4.281373076621F,   -4.439290868194F,
      -4.600687957164F,   -4.765789482863F,   -4.934837786827F,   -5.108094262754F,
      -5.285841447724F,   -5.468385392850F,   -5.656058358524F,   -5.849221888038F,
      -6.048270323752F,   -6.253634842763F,   -6.465788104734F,   -6.685249623933F,
      -6.912592001641F,   -7.148448185197F,   -7.393519957715F,   -7.648587910311F,
      -7.914523209316F,   -8.192301548699F,   -8.483019777938F,   -8.787915825540F,
      -9.108392708319F,   -9.446047640700F,   -9.802707556566F,  -10.180472756752F,
     -10.581770938737F,  -11.009424610292F,  -11.466735922418F,  -11.957594408482F,
     -12.486615182205F,  -13.059318129981F,  -13.682363008020F,  -14.363861882889F,
     -15.113800279100F,  -15.944613802310F,  -16.871991469418F,  -17.916016823319F,
     -19.102824687988F,  -20.467066980793F,  -22.055688411826F,  -23.933901093131F,
     -26.195009811958F,  -28.977326547983F,  -32.494947692090F,  -37.097726571439F,
     -43.398778458313F,  -52.578642127936F,  -67.237140940616F,  -94.436181234713F,
    -162.436285816397F, -638.697683103490F,  314.133813151232F,  123.793540207494F,
      76.443103403040F,   55.191484179902F,   43.380771193794F,   36.166786430229F,
      31.692415697772F,   29.196533467889F,   28.488153687820F,   29.875260978452F,
      34.480540348912F,   45.584247679780F,   75.366785927375F,  224.819757551863F,
    -315.479927970347F, -114.089128277307F,  -82.505811387486F,  -74.473992234719F,
     -76.615050223877F,  -87.917378826038F, -114.770299250059F, -188.393136988693F,
    -754.968628196304F,  319.155146125482F,  124.851218827837F,   75.262935279868F,
      52.687655734439F,   39.787924922133F,   31.424159535297F,   25.536782656267F,
      21.141721540793F,   17.710287798316F,   14.933343652143F,   12.618029059184F,
      10.637606761166F,    8.905081023646F,    7.358404092369F,    5.951726281778F,
       4.649974580615F,    3.425345764161F,    2.254937022006F,    1.119065080281F,
     106.748590110658F,  106.916035080185F,  107.422367895757F,  108.279859636539F,
     109.509926042681F,  111.144720946161F,  113.229700131753F,  115.827592424544F,
     119.024535004642F,  122.939709704560F,  127.740927323948F,  133.670861437698F,
     141.093525337492F,  150.582074206695F,  163.098743043415F,  180.404766833923F,
     206.138441101402F,  249.308666704181F,  340.250803408066F,  685.554215142288F,
    1204.377575534053F,  214.854438048825F,  116.919147955025F,  123.988621654253F,
     161.481532252701F,  219.295491560795F,  316.987731783746F,  539.010412499159F,
    1731.848897308773F, 1350.994847147500F,  464.415569998161F,  268.398627084039F,
     180.285133618221F,  128.934175196816F,   94.429379029216F,   69.217155473982F,
      50.612863287596F,   40.100084428223F,   43.855172680781F,   65.846053364357F,
     110.715768936079F,  208.861947039296F,  593.073505918915F, 1309.281820199827F,
     353.757330852624F,  215.066012790354F,  158.265416910686F,  126.804918503642F,
     106.530773873675F,   92.215701833925F,   81.474079372943F,   73.058258559015F,
      66.249993394767F,   60.605089867710F,   55.833115525982F,   51.735527755602F,
      48.171566332742F,   45.038364165763F,   42.258795839895F,   39.773755884088F,
      37.537084012821F,   35.512131358717F,   33.669377087322F,   31.984736477517F,
      30.438335632090F,   29.013608133951F,   27.696618276586F,   26.475546629848F,
      25.340293818422F,   24.282171664524F,   23.293659774948F,   22.368211764048F,
      21.500099555100F,   20.684287203287F,   19.916327830943F,   19.192278822015F,
      18.508631564001F,   17.862252871707F,   17.250335860995F,   16.670358519948F,
      16.120048590589F,   15.597353655746F,   15.100415543904F,   14.627548335500F,
      14.177219388320F,   13.748032906045F,   13.338715658745F,   12.948104532119F,
      12.575135637113F,   12.218834755974F,   11.878308937019F,   11.552739080040F,
      11.241373378588F,   10.943521505531F,   10.658549444895F,   10.385874886857F,
      10.124963114287F,    9.875323318912F,    9.636505293258F,    9.408096451319F,
       9.189719136693F,    8.981028181752F,    8.781708685555F,    8.591473981791F,
       8.410063771043F,    8.237242394362F,    8.072797227502F,    7.916537177290F,
       7.768291263563F,    7.627907272009F,    7.495250465026F,    7.370202339551F,
       7.252659422651F,    7.142532097562F,    7.039743454846F,    6.944228165391F,
       6.855931374068F,    6.774807615035F,    6.700819751782F,    6.633937947094F,
       6.574138670010F,    6.521403748550F,    6.475719478381F,    6.437075798536F,
       6.405465545873F,    6.380883799913F,    6.363327329180F,    6.352794149042F,
       6.349283199469F,    0.000000000000F,    0.010466956741F,    0.020992859307F,
       0.031639469577F,    0.042474442236F,    0.053574963961F,    0.065032348807F,
       0.076958150092F,    0.089492635705F,    0.102816966904F,    0.117171285899F,
       0.132882483376F,    0.150408362825F,    0.170410721587F,    0.193881934368F,
       0.222376351261F,    0.258461594847F,    0.306670920864F,    0.375716122055F,
       0.484248351002F,   -2.464084125668F,   -2.072341335048F,   -1.378778077965F,
      -0.788187213996F,   -0.494340092491F,   -0.346497618561F,   -0.263312985841F,
      -0.213277276700F,   -0.183186479209F,    2.974404346912F,    2.978588695038F,
       2.970927520002F,    2.949151458096F,    2.907758109873F,    2.835130632266F,
       2.706151254598F,    2.464957388672F,    2.017414393290F,    1.423575286728F,
       0.993955374547F,    0.762103465462F,    0.634413322958F,    0.558212592267F,
      -2.631998596886F,   -2.664527123397F,   -2.686992367087F,   -2.702809883042F,
      -2.714043324184F,   -2.722006487099F,   -2.727572625858F,   -2.731343452823F,
      -2.733746420273F,   -2.735093259175F,   -2.735616569808F,   -2.735493457217F,
      -2.734861241719F,   -2.733828167527F,   -2.732480866188F,   -2.730889662404F,
      -2.729112413649F,   -2.727197333725F,   -2.725185099590F,   -2.723110444480F,
      -2.721003377374F,   -2.718890127042F,   -2.716793880570F,   -2.714735366765F,
      -2.712733321256F,   -2.710804860467F,   -2.708965784763F,   -2.707230826042F,
      -2.705613851417F,   -2.704128031870F,   -2.702785982777F,   -2.701599881618F,
      -2.700581567064F,   -2.699742622681F,   -2.699094447834F,   -2.698648317800F,
      -2.698415434659F,   -2.698406970218F,   -2.698634101887F,   -2.699108042242F,
      -2.699840062797F,   -2.700841512337F,   -2.702123830044F,   -2.703698553511F,
      -2.705577321644F,   -2.707771872349F,   -2.710294034820F,   -2.713155716174F,
      -2.716368882093F,   -2.719945531090F,   -2.723897661951F,   -2.728237233874F,
      -2.732976118780F,   -2.738126045260F,   -2.743698533626F,   -2.749704821537F,
      -2.756155779730F,   -2.763061817436F,   -2.770432777183F,   -2.778277818818F,
      -2.786605292760F,   -2.795422602728F,   -2.804736058486F,   -2.814550719433F,
      -2.824870230315F,   -2.835696650703F,   -2.847030280426F,   -2.858869483586F,
      -2.871210514389F,   -2.884047348482F,   -2.897371524032F,   -2.911171997200F,
      -2.925435017001F,   -2.940144024777F,   -2.955279583515F,   -2.970819342108F,
      -2.986738039232F,   -3.003007550858F,   -3.019596984511F,   -3.036472822199F,
      -3.053599112556F,   -3.070937711172F,   -3.088448566440F,   -3.106090046536F,
      -3.123819301583F,    3.141592653590F, };

uint16_t pass = 0U, fail = 0U;
float tolerance = 1.0e-3;
volatile uint16_t flagInputReady = 0;
volatile uint16_t sampleIndex = 0;
uint32_t max_idx = 1;

float32_t test_output[myRFFT0_RFFT_SIZE];
float32_t test_error[myRFFT0_RFFT_SIZE];
float32_t test_magnitude_phase[(myRFFT0_RFFT_SIZE >> 1) + 1];
float32_t twiddleFactors[myRFFT0_RFFT_SIZE];

uint16_t *inADC;
float32_t *inPtr = (float32_t *)test_input;
float32_t *outPtr = test_output;
float32_t *magPtr = test_magnitude_phase;
float32_t *phasPtr = test_magnitude_phase;

#ifdef __cplusplus
#pragma DATA_SECTION("FFT_buffer_1")
#else
#pragma DATA_SECTION(test_input, "FFT_buffer_1")
#endif

#ifdef __cplusplus
#pragma DATA_SECTION("FFT_buffer_2")
#else
#pragma DATA_SECTION(test_output, "FFT_buffer_2")
#endif

//
// Main
//
void main(void)
{
	//
    // Initialize CPU and peripherals
    //
    Device_init();
    Device_initGPIO();
    Interrupt_initModule();
    Interrupt_initVectorTable();
	Board_init();
    C2000Ware_libraries_init();

    int16_t i, j;
    float32u_t out, gold, err;
    float *p_temp;

    RFFT_f32(myRFFT0_handle);

    p_temp      = test_output;
    for(i = 0U; i < myRFFT0_RFFT_SIZE; i++)
    {
        out.f32     = p_temp[i];
        gold.f32    = test_golden[i];
        err.f32     = fabsf(out.f32 - gold.f32);
        if(err.f32 < tolerance)
        {
            pass++;
        }
        else
        {
            fail++;
        }
        test_error[i] = err.f32;
    }

    RFFT_f32_mag_TMU0(myRFFT0_handle);
    p_temp      = test_magnitude_phase;

    for(i = (myRFFT0_RFFT_SIZE), j=0U; i <= (myRFFT0_RFFT_SIZE+(myRFFT0_RFFT_SIZE >> 1)); i++, j++)
    {
        out.f32     = p_temp[j];
        gold.f32    = test_golden[i];
        err.f32     = fabsf(out.f32 - gold.f32);
        if(err.f32 < tolerance)
        {
            pass++;
        }
        else
        {
            fail++;
        }
        test_error[j] = err.f32;
    }

    RFFT_f32_phase_TMU0(myRFFT0_handle);
    p_temp      = test_magnitude_phase;

    for(i  = (myRFFT0_RFFT_SIZE+(myRFFT0_RFFT_SIZE >> 1)+1U), j=0U;
        i <= ((myRFFT0_RFFT_SIZE << 1)); i++, j++)
    {
        out.f32     = p_temp[j];
        gold.f32    = test_golden[i];
        err.f32     = fabsf(out.f32 - gold.f32);
        if(err.f32 < tolerance)
        {
            pass++;
        }
        else
        {
            fail++;
        }
        test_error[j] = err.f32;
    }
    while(1);
}

//
// End of File
//
